# Pandas

https://pandas.pydata.org/docs/user_guide/index.html

In [2]:
import numpy as np
import pandas as pd

## 数据的创建

In [3]:
df = pd.DataFrame({"id":[1001,1002,1003,1004,1005,1006], 
 "date":pd.date_range('20130102', periods=6),
  "city":['Beijing ', 'SH', ' guangzhou ', 'Shenzhen', 'shanghai', 'BEIJING '],
 "age":[23,44,54,32,34,32],
 "category":['100-A','100-B','110-A','110-C','210-A','130-F'],
  "price":[1200,np.nan,2133,5433,np.nan,4432]},
  columns =['id','date','city','category','age','price'])

df

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
1  1002 2013-01-03           SH    100-B   44     NaN
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
4  1005 2013-01-06     shanghai    210-A   34     NaN
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

## 数据纵向截取

In [5]:
df['id']

0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
Name: id, dtype: int64

## 数据横线截取

In [6]:
df.values

array([[1001, Timestamp('2013-01-02 00:00:00'), 'Beijing ', '100-A', 23,
        1200.0],
       [1002, Timestamp('2013-01-03 00:00:00'), 'SH', '100-B', 44, nan],
       [1003, Timestamp('2013-01-04 00:00:00'), ' guangzhou ', '110-A',
        54, 2133.0],
       [1004, Timestamp('2013-01-05 00:00:00'), 'Shenzhen', '110-C', 32,
        5433.0],
       [1005, Timestamp('2013-01-06 00:00:00'), 'shanghai', '210-A', 34,
        nan],
       [1006, Timestamp('2013-01-07 00:00:00'), 'BEIJING ', '130-F', 32,
        4432.0]], dtype=object)

## 数据的拼接
how: One of ‘left’, ‘right’, ‘outer’, ‘inner’. 默认inner。inner是取交集，outer取并集。比如left：[‘A’,‘B’,‘C’];right[’'A,‘C’,‘D’]；inner取交集的话，left中出现的A会和right中出现的买一个A进行匹配拼接，如果没有是B，在right中没有匹配到，则会丢失。'outer’取并集，出现的A会进行一一匹配，没有同时出现的会将缺失的部分添加缺失值。

In [16]:
df1 = pd.DataFrame({"A":[1001,1002,1003,1004,1005,1006], 
                   "B":[1011,1012,1013,1014,1015,1016],
                   "C":[1021,1022,1023,1024,1025,1026]})
df1

df2 = pd.DataFrame({"D":[1051,1052,1053,1054,1055,1056], 
                   "E":[1061,1062,1063,1074,1085,1096],
                   "C":[1021,1022,1023,1024,1025,1026]})

df2

df3 = pd.merge(df1,df2,how = 'inner',on='C')
df3

      A     B     C     D     E
0  1001  1011  1021  1051  1061
1  1002  1012  1022  1052  1062
2  1003  1013  1023  1053  1063
3  1004  1014  1024  1054  1074
4  1005  1015  1025  1055  1085
5  1006  1016  1026  1056  1096

In [25]:
df1 = pd.DataFrame([[1,2,3],[1,10,20],[5,6,7],[3,9,0],[8,0,3]],columns=['x1','x2','x3'])
df2 = pd.DataFrame([[1,2],[1,10],[5,3],[3,6],[8,9]],columns=['x1','x4'])
print (df1)
print (df2)

   x1  x2  x3
0   1   2   3
1   1  10  20
2   5   6   7
3   3   9   0
4   8   0   3
   x1  x4
0   1   2
1   1  10
2   5   3
3   3   6
4   8   9

In [26]:
df3 = pd.merge(df1,df2,how = 'inner',on='x1')
df3

   x1  x2  x3  x4
0   1   2   3   2
1   1   2   3  10
2   1  10  20   2
3   1  10  20  10
4   5   6   7   3
5   3   9   0   6
6   8   0   3   9

## 数据的分组聚合

In [27]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
     'key2':['one', 'two', 'one', 'two', 'one'],
     'data1':np.random.randn(5),
     'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.810136 -0.261776
1    a  two  1.418821  1.784775
2    b  one -0.407386  0.321194
3    b  two  0.842430  0.052241
4    a  one -0.809479 -1.086368

In [28]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [30]:
grouped.mean()

key1
a    0.473159
b    0.217522
Name: data1, dtype: float64

In [31]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     0.000328
      two     1.418821
b     one    -0.407386
      two     0.842430
Name: data1, dtype: float64